
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.0   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

2-user 16-core Stata network perpetual license:
       Serial number:  501306200703
         Licensed to:  HPC, ITS
                       New York University, NY

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do 130812_regressions_allyears_tenuredays.do 

. * REGRESSIONS IN ALL YEARS
. * USE THE DEFINITION OF TENURE BASED ON THE DAYS WORKED and SEPARATION IN THA
> T YEAR
. 
. local filepath "/scratch/kb103/stata/earnings_losses"

. 
. * CREATE FILES THE REGRESSIONS
. 
. forval yy = 1976/2005{
  2. 
.         use "`filepath'/control_treatment_ind_year`yy'.dta"
  3.         keep if CG5_men==1 | CG5_women==1
  4.         keep pid CG5*
  5.         by pid: gen int index = _n
  6.         keep if index==1
  7.         drop index
  8.         saveold "`filepath'/EL_pid_CG5`yy'.dta", replace
  9. 
.         use "`filepath'/control_treatment_ind_year`yy'.dta"
 10.         keep if TG5_men==1 | TG5_women==1
 11.         by pid: gen int index = _n
 12.         keep if index == 1
 13.         drop index
 14.         keep pid TG5*
 15.         saveold "`filepath'/EL_pid_TG5`yy'.dta", replace
 16.         
. }
(163652 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51976.dta saved
(787358 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51976.dta saved
(128506 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51977.dta saved
(788410 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51977.dta saved
(135914 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51978.dta saved
(805964 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51978.dta saved
(140463 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51979.dta saved
(810239 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51979.dta saved
(134099 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51980.dta saved
(809514 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51980.dta saved
(150811 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51981.dta saved
(827945 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51981.dta saved
(160554 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51982.dta saved
(856771 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51982.dta saved
(156933 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51983.dta saved
(877225 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51983.dta saved
(130900 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51984.dta saved
(878145 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51984.dta saved
(129587 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51985.dta saved
(876698 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51985.dta saved
(133237 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51986.dta saved
(877484 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51986.dta saved
(143118 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51987.dta saved
(863334 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51987.dta saved
(157630 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51988.dta saved
(861830 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51988.dta saved
(132984 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51989.dta saved
(845558 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51989.dta saved
(151566 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51990.dta saved
(851709 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51990.dta saved
(156532 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51991.dta saved
(857875 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51991.dta saved
(167498 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51992.dta saved
(873011 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51992.dta saved
(169184 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51993.dta saved
(887230 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51993.dta saved
(153845 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51994.dta saved
(890793 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51994.dta saved
(154589 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51995.dta saved
(901181 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51995.dta saved
(158617 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51996.dta saved
(925517 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51996.dta saved
(151890 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51997.dta saved
(925667 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51997.dta saved
(134306 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51998.dta saved
(918531 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51998.dta saved
(147407 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG51999.dta saved
(915064 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG51999.dta saved
(141171 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG52000.dta saved
(909692 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG52000.dta saved
(147787 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG52001.dta saved
(907291 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG52001.dta saved
(159573 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG52002.dta saved
(873791 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG52002.dta saved
(153194 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG52003.dta saved
(866400 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG52003.dta saved
(145898 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG52004.dta saved
(875496 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG52004.dta saved
(149153 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_CG52005.dta saved
(890640 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_pid_TG52005.dta saved

. 
. * REGRESSION FILES
. 
. forval yy = 1976/2003{  
  2. 
.         * DEAL WITH DUPLICATE OBSERVATIONS - IF A WORKER IS IN MORE THAN ONE 
> TREATMENT/CONTROL GROUP
.         local endy = `yy'+2
  3.         local begy = `yy'+1
  4.         use "`filepath'/EL_pid_CG5`yy'.dta"     
  5.         forval yy1 = `yy'/`endy'{
  6.                 append using "`filepath'/EL_pid_TG5`yy'.dta"
  7.         }
  8.         keep pid 
  9.         sort pid
 10.         by pid: gen int index = _n
 11.         by pid: egen int maxindex = max(index)
 12.         drop if maxindex>1
 13.         keep if index==1
 14.         keep pid
 15.         save  "`filepath'/EL_`yy'_CTG5tokeep.dta", replace
 16.         
.         * CREATE A FILE FOR REGRESSION
.         clear
 17.         use "`filepath'/EL_annual_income_year`yy'.dta" 
 18.         keep if CG5_men==1 | CG5_women==1 | TG5_men==1 | TG5_women==1
 19.         forval yy1 = `begy'/`endy'{
 20.                 append using "`filepath'/EL_Davis_annual_income_year`yy1'.
> dta"
 21.         }
 22.         merge m:1 pid using "`filepath'/EL_`yy'_CTG5tokeep.dta"
 23.         keep if _merge==3
 24.         drop _merge
 25.   
.         save "`filepath'/regression_annual_income_year_CTG5`yy'.dta" , replac
> e
 26.         
. }
(20937 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_1976_CTG5tokeep.dta saved
(3750434 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       534,199
        from master                   533,258  (_merge==1)
        from using                        941  (_merge==2)

    matched                        14,538,907  (_merge==3)
    -----------------------------------------
(534199 observations deleted)
file /scratch/kb103/stata/earnings_losses/regression_annual_income_year_CTG5197
> 6.dta saved
(19680 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_1977_CTG5tokeep.dta saved
(2987424 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       603,150
        from master                   602,257  (_merge==1)
        from using                        893  (_merge==2)

    matched                        15,906,947  (_merge==3)
    -----------------------------------------
(603150 observations deleted)
file /scratch/kb103/stata/earnings_losses/regression_annual_income_year_CTG5197
> 7.dta saved
(25566 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_1978_CTG5tokeep.dta saved
(3131316 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       709,301
        from master                   708,444  (_merge==1)
        from using                        857  (_merge==2)

    matched                        16,674,340  (_merge==3)
    -----------------------------------------
(709301 observations deleted)
file /scratch/kb103/stata/earnings_losses/regression_annual_income_year_CTG5197
> 8.dta saved
(26580 observations deleted)
(0 observations deleted)
file /scratch/kb103/stata/earnings_losses/EL_1979_CTG5tokeep.dta saved
(3248424 observations deleted)
